load-tests/c_test.yaml
config:
 target: 'http://localhost:2358'
 phases:
  - name: warmup
    duration: 10
    arrivalRate: 1
  # - name: testing_phase
  #   duration: 1800
  #   arrivalRate: 5
  # - name: submitting
  #   duration: 300
  #   arrivalRate: 2
 processor: './functions.js'
scenarios:
 - flow:
    - post:
       url: '/submissions'
       headers:
        Content-Type: 'application/json'
       json:
        source_code: '#include<stdio.h>#include<stdlib.h>#define S 100int c(const void *a,const void *b){return(*(int*)a-*(int*)b);}int main(){int n[S],i;for(i=0;i<S;i++){if(scanf("%d",&n[i])!=1){fprintf(stderr,"Error.\n");return 1;}}qsort(n,S,sizeof(int),c);for(i=0;i<S;i++){printf("%d ",n[i]);}printf("\n");return 0;}'
        language_id: 50
        stdin: '59 17 36 97 81 1 53 54 25 27 83 80 74 70 21 34 78 68 65 66 93 92 4 53 66 19 74 26 13 79 95 47 18 4 28 93 39 38 41 90 67 27 85 90 86 40 64 49 97 20 15 93 97 82 16 53 96 19 24 39 77 90 73 79 69 29 55 70 7 90 81 66 24 55 56 40 44 7 62 47 67 49 66 17 95 21 94 80 68 40 16 50 28 17 64 99 12 26 49 97 36 53 53 21'
        expected_output: '1 4 4 7 7 12 13 15 16 16 17 17 17 18 19 19 20 21 21 21 24 24 25 26 26 27 27 28 28 29 34 36 36 38 39 39 40 40 40 41 44 47 47 49 49 49 50 53 53 53 53 53 54 55 55 56 59 62 64 64 65 66 66 66 66 67 67 68 68 69 70 70 73 74 74 77 78 79 79 80 80 81 81 82 83 85 86 90 90 90 90 92 93 93 93 94 95 95 96 97 97 97 97 99'
       capture:
        json: '$.token'
        as: 'token'
    - loop:
       - get:
          url: '/submissions/{{ token }}'
          capture:
           - json: $.status.id
             as: statusId
           - json: $.stdout
             as: stdout
      whileTrue: 'isNotDone'